cats99/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "2022-03-01"], ["color", "orange"], ["name", "Pizza"], ["sex", "M"], ["description", "likes to eat"], ["updated_at", "2022-07-01 21:04:06.656357"], ["id", 8]]